import React from "react";
import "./PageTemplate.css";
 
function CourseFormat() {
  
  return (
    <div className="pageTemplate backTemp">
      
      <h1>מבנה הקורס</h1>
      <p>שלב הלימוד בקורס נמשך כ-9 חודשים, ומתקיים בימי ראשון ושלישי בין השעות 17:30-21:30. בימי שישי תרגול חופשי עם מתנדבים בין השעות 08:00-13:00.</p>
      <p>מידי שבוע יינתנו מטלות כיתה שיבוצעו בתרגולים ובבית. הזמן הנדרש להשקעה בבית, מעבר לשעות ההרצאות והתרגולים הוא כ-10 שעות בשבוע. </p>
      <p>בתום שלב הלימוד על הסטודנטים לכתוב פרויקט פנימי, ולאחר מכן פרויקט חיצוני. משך העבודה על כל פרויקט כחודש וחצי.</p>
       
      <h2>מתכונת ההרצאות בקורס</h2>
      <p>התוכנית תשלב בין הרצאות פרונטליות להרצאות וידאו :</p>
      <ul>
        <li>בחודשים 1-2: שתי הרצאות פרונטליות בשבוע.</li>
        <li>בחודשים 3-9: שתי הרצאות בשבוע, אחת פרונטלית ושניה online.</li>
      </ul>
       
    </div>
  );
};

export default CourseFormat;